# Salary of Employee Estimator

This is a simple Estimator based on Linear Regression model on Multivariate analysis to estimate the salary of a newly hired employee based on the various given input features. Since the Data set is small, there will not be a train/test split applied, so inaccuracy in estimation is highly expected.

# Importing Libraries

In [1]:
import numpy as np
import pandas as pd

# Loading Data

In [2]:
hire = pd.read_csv('C:/Users/LENOVO/# Jupyter Notebook Files/Machine Learning/Resources/py/ML/2_linear_reg_multivariate/Exercise/hiring.csv')
hire

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

# Data Cleaning

* #### Detecting Null values

In [3]:
hire.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [4]:
hire['experience'] = hire['experience'].fillna('zero')
hire['test_score(out of 10)'] = hire['test_score(out of 10)'].fillna(int(hire['test_score(out of 10)'].mean()))

#### Null values detected are resolved.

* #### Converting Categorical data to Numerical data

In [5]:
def word_to_number(word):
    """ This is a function that converts text/words into numbers"""
    words = {
        'zero': 0,
        'one': 1,
        'two': 2,
        'three': 3,
        'four': 4,
        'five': 5,
        'six': 6,
        'seven': 7,
        'eight': 8,
        'nine': 9,
        'ten': 10,
        'eleven': 11,
        'twelve': 12,
        'thirteen': 13,
        'fouteen': 14,
        'fifteen': 15,
        'sixteen': 16,
        'seventeen': 17,
        'eighteen': 18,
        'nineteen': 19,
        'twenty': 20
    }
    number = 0
    for i in words:
        if word == i:
            number = words[i]
    return number

In [6]:
hire['experience'] = hire['experience'].apply(lambda x: x.lower())
hire['experience'] = hire['experience'].apply(word_to_number)
hire

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

#### Discrepencies found in the data were removed.

# Model Creation

In [7]:
from sklearn.linear_model import LinearRegression

In [8]:
linear_model = LinearRegression()

# Training the Model

In [9]:
linear_model.fit(hire[['experience', 'test_score(out of 10)', 'interview_score(out of 10)']],hire['salary($)'])

LinearRegression()

# Testing the Model

In [10]:
experience = int(input("How many years of experience does the employee have ? : "))
test_score = int(input("What was the employee's test score  ? : "))
interview_score = int(input("What was the employee's interview score  ? : "))
salary_estimated = int(linear_model.predict([[experience,test_score,interview_score]]))
print("\n The Model Estimated the salary of a Employee with {} years of experience with a test score of {} and a interview score of {} to be $ {}".format(experience,test_score,interview_score,salary_estimated))

How many years of experience does the employee have ? : 12
What was the employee's test score  ? : 10
What was the employee's interview score  ? : 10

 The Model Estimated the salary of a Employee with 12 years of experience with a test score of 10 and a interview score of 10 to be $ 93747

# Visualizing the Model

The Model cannot be visualized based on the 'line of best fit' as it has atleast 4 Dimensions. A Maximum of only 3 Dimensions can be Visualized.